
<!--
  /**************************************************************
  *名称:插入图片、Flash、视频、表格
  *功能:实现所见即所得编辑（WYSWYG）
  *时间:2009年10月30日06时31分
  *地点:西北大学教工六楼一单元703室
  *作者:闲庭信步
  *QQ:445424680
  *邮箱 :445424680@qq.com
  *************************************************************/
-->
<title>第4.5节 插入图片、Flash、视频、表格</title>
<!--第1步 设计一个表格，设置窗口宽度为480px，位置为居中-->
<table align=center>
  <tr>
    <td>
      <!--第2步 设置AEE_input：插件要改变的文本域-->
      <br/>
      <br/>
      <br/>
      <br/>
      <br/>
      <textarea style=display:none; id=AEE_contentTextarea name=content cols="400" rows="300"></textarea>
      <!--插件要改变的文本域-->
      <input type=button value="显示隐藏文本域内容" onclick="AEE_showContentTextarea();"/>
      <br/>
      <!--第3步 显示插件-->
<script type=text/javascript src=AEE.js></script>
<script type=text/javascript>
      /*********************************************************************************************************************
       * 参数代号        | 参数名称         | 参数限制        | 计量单位         | 可否为空         | 建议赋值          *
	   ********************************************************************************************************************
	   * id              | 文本文本id       | 字符串          |                  | 否               |                   *
	   *------------------------------------------------------------------------------------------------------------------*
	   * width           | 插件宽度         | 正整数          | 像素(px)         | 否               | >=480             *
	   *------------------------------------------------------------------------------------------------------------------*
	   * height          | 插件高度         | 正整数          | 像素(px)         | 否               | >=300             *
	   *------------------------------------------------------------------------------------------------------------------*
	   * uploadPath1     | 附件上传地址     | 相对网页路径    |                  | 可               |                   *
	   *------------------------------------------------------------------------------------------------------------------*
	   * uploadPath2     | 附件上传地址     | 相对脚本路径    |                  | 可               |                   *
	   *------------------------------------------------------------------------------------------------------------------*
	   * bgColor         | 背景颜色         | 颜色值          |                  | 可               | #FFFFFF           *
	   *------------------------------------------------------------------------------------------------------------------*
	   * menuColor       | 菜单颜色         | 颜色值          |                  | 可               | #EFEEE1           *
	   *------------------------------------------------------------------------------------------------------------------*
	   * borderColor     | 边框颜色         | 颜色值          |                  | 可               | #316AC5           *
      *********************************************************************************************************************/
	  //AEE.container = AEE_container;
	  AEE.show('AEE_contentTextarea',480,300,'upload/','upload/');
    </script>
      <br/>
      <input type=button value="显示codeTextarea内容" onclick="AEE_showCodeTextarea();"/>
      <!--测试按钮一-->
    </td>
  </tr>
</table>
<script type="text/javascript" ></script>
